'''
Эта программа спрашивает у пользователя:
- имя исследователя;
- название эксперимента;
- количество выполненных запусков — целое число;
- длительность одного запуска в секундах — вещественное число;
- действительную и мнимую части комплексного коэффициента — два вещественных числа.

И выдает:
- название эксперимента
- имя исследователя
- общую длительность всех запусков в секундах;
- общую длительность в минутах;
- комплексный коэффициент;
- квадрат модуля коэффициента;
- является ли число запусков ненулевым
'''

exp = input("Название эксперимента: ")
name = input("Имя исследователя: ")
launch = int(input("Количество выполненных запусков(целое число): "))
duration = float(input("Длительность одного запуска в секундах(вещественное число): "))
real,imag = map(float,input("Действительная и мнимая части комплексного коэффициента(два вещественных числа): ").split())

total_time=duration*launch
has_runs=bool(launch)
total_time_minutes = total_time / 60
complex_rate= complex(real,imag)
mod = real**2 + imag**2

print("========================================")
print(f"ЭКСПЕРИМЕНТ: {exp}")
print(f"Исследователь: {name}")
print(f"Запуски: {launch}")
print(f"Общее время: {total_time:.2f} с ({total_time_minutes:.2f} мин)")
print(f"Коэффициент: {complex_rate}")
print(f"Квадрат модуля: {mod:.2f}")
print(f"Есть выполненные запуски: {has_runs}")
print("========================================")
print()
print("Типы введенных данных:")
print(f"Эксперимент: {exp} - {type(exp)}")
print(f"Имя: {name} - {type(name)}")
print(f"Кол-во запусков: {launch} - {type(launch)}")
print(f"Время запуска: {duration} - {type(duration)}")
print(f"Действительная часть коэффицента: {real} - {type(real)}")
print(f"Мнимая часть коэффицента: {imag} - {type(imag)}")